sunklCoin/MCU/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v3.0
processor: LPC54608J512
package_id: LPC54608J512ET180
mcu_data: ksdk2_0
processor_version: 2.0.2
board: LPCXpresso54608
pin_labels:
- {pin_num: K12, pin_signal: PIO1_1/FC3_RXD_SDA_MOSI/CTIMER0_CAP3/SCT0_GPI5/USB1_OVERCURRENTN, label: WiFi SPI MOSI pin, identifier: WIFI_SPI_MOSI}
- {pin_num: A13, pin_signal: PIO3_3/LCD_VD(17)/FC9_TXD_SCL_MISO, label: LCD WR pin, identifier: LCD_WR}
- {pin_num: C3, pin_signal: PIO2_2/ENET_CRS/FC3_SSEL3/SCT0_OUT6/CTIMER1_MAT1, label: Zigbee reset pin, identifier: ZB_RST}
- {pin_num: E3, pin_signal: PIO3_14/SCT0_OUT4/FC9_RTS_SCL_SSEL1/CTIMER3_MAT1/TRACEDATA(2), label: BLE wake up pin, identifier: BT_WAKEUP}
- {pin_num: A1, pin_signal: PIO0_1/CAN1_TD/FC3_CTS_SDA_SSEL0/CTIMER0_CAP0/SCT0_GPI1/PDM0_DATA, label: Power key, identifier: PWR_KEY}
- {pin_num: D6, pin_signal: PIO0_0/CAN1_RD/FC3_SCK/CTIMER0_MAT0/SCT0_GPI0/PDM0_CLK, label: IR PMW, identifier: ISP_FC3_SCK}
- {pin_num: D2, pin_signal: PIO3_15/FC8_SCK/SD_WR_PRT, label: BLE reserved, identifier: BT_REV}
- {pin_num: P1, pin_signal: PIO2_10/ENET_RX_ER/SD_CARD_DET_N, label: Zigbee uart mode select, identifier: ZB_UART_MODE}
- {pin_num: F3, pin_signal: PIO2_6/ENET_TX_CLK/SD_D(0)/FC1_RTS_SCL_SSEL1/CTIMER0_CAP0, label: Zigbee uart rts, identifier: ZB_UART_RTS}
- {pin_num: B1, pin_signal: PIO2_3/ENET_TXD2/SD_CLK/FC1_RXD_SDA_MOSI/CTIMER2_MAT0, label: Zigbee uart rx, identifier: ZB_UART_RX}
- {pin_num: D3, pin_signal: PIO2_4/ENET_TXD3/SD_CMD/FC1_TXD_SCL_MISO/CTIMER2_MAT1, label: Zigbee uart tx, identifier: ZB_UART_TX}
- {pin_num: C1, pin_signal: PIO2_5/ENET_TX_ER/SD_POW_EN/FC1_CTS_SDA_SSEL0/CTIMER1_MAT2, label: Zigbee uart cts, identifier: ZB_UART_CTS}
- {pin_num: N14, pin_signal: PIO1_24/FC2_RXD_SDA_MOSI/SCT0_OUT1/FC3_SSEL3/EMC_A(12), label: WiFi SPI CS pin, identifier: WIFI_SPI_CS}
- {pin_num: B12, pin_signal: PIO0_22/FC6_TXD_SCL_MISO_WS/UTICK_CAP1/CTIMER3_CAP3/SCT0_OUT3/USB0_VBUS, label: Keyboard int pin, identifier: KB_INT}
- {pin_num: B13, pin_signal: PIO0_29/FC0_RXD_SDA_MOSI/CTIMER2_MAT3/SCT0_OUT8/TRACEDATA(2), label: WiFi int pin, identifier: WIFI_INT}
- {pin_num: A2, pin_signal: PIO0_30/FC0_TXD_SCL_MISO/CTIMER0_MAT0/SCT0_OUT9/TRACEDATA(1), label: WiFi mode select pin, identifier: WIFI_HM0}
- {pin_num: P2, pin_signal: PIO0_10/FC6_SCK/CTIMER2_CAP2/CTIMER2_MAT0/FC1_TXD_SCL_MISO/SWO/ADC0_0, label: Battery Temperature detect, identifier: SWO_TRGT}
- {pin_num: E14, pin_signal: PIO0_17/FC4_SSEL2/SD_CARD_DET_N/SCT0_GPI7/SCT0_OUT0/EMC_OEN/ENET_TXD1, label: WiFi chip power down pin, identifier: WIFI_CHIP_PWD}
- {pin_num: C4, pin_signal: PIO4_16/ENET_MDIO/CTIMER4_MAT3/FC9_TXD_SCL_MISO, label: LCD reset pin, identifier: LCD_RST}
- {pin_num: H11, pin_signal: PIO2_26/LCD_VD(8)/FC3_SCK/CTIMER2_CAP1, label: WiFi SPI CLK pin, identifier: WIFI_SPI_CLK}
- {pin_num: P12, pin_signal: PIO2_19/LCD_VD(1)/FC3_TXD_SCL_MISO/FC7_RXD_SDA_MOSI_DATA/CTIMER3_MAT1, label: WiFi SPI MISO pin, identifier: WIFI_SPI_MISO}
- {pin_num: B2, pin_signal: PIO3_11/MCLK/FC0_SCK/FC1_SCK/TRACEDATA(3), label: Keyboard reset pin, identifier: KB_RST}
- {pin_num: E1, pin_signal: PIO3_16/FC8_RXD_SDA_MOSI/SD_D(4), label: BLE uart rx, identifier: BT_UART_RX}
- {pin_num: K1, pin_signal: PIO3_17/FC8_TXD_SCL_MISO/SD_D(5), label: BLE uart tx, identifier: BT_UART_TX}
- {pin_num: P11, pin_signal: PIO1_22/FC8_RTS_SCL_SSEL1/SD_CMD/CTIMER2_MAT3/SCT0_GPI5/FC4_SSEL3/EMC_CKE(1), label: 'U28[F3]/P1_22-EMC_CKE1', identifier: EMC_CKE1}
- {pin_num: M4, pin_signal: PIO0_16/FC4_TXD_SCL_MISO/CLKOUT/CTIMER1_CAP0/EMC_CSN(0)/ENET_TXD0/ADC0_4, label: Charger enable pin, identifier: CHG_EN}
- {pin_num: M5, pin_signal: PIO0_31/FC0_CTS_SDA_SSEL0/SD_D(2)/CTIMER0_MAT1/SCT0_OUT3/TRACEDATA(0)/ADC0_5, label: BLE int pin, identifier: BT_INT}
- {pin_num: N3, pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/SD_D(3)/CTIMER0_CAP2/SCT0_GPI4/TRACECLK/ADC0_6, label: Charger detect pin, identifier: CHG_DET}
- {pin_num: N12, pin_signal: PIO1_17/ENET_MDIO/FC8_RXD_SDA_MOSI/SCT0_OUT4/CAN1_TD/EMC_BLSN(0), label: Touchpanel int pin, identifier: TP_INT}
- {pin_num: D1, pin_signal: PIO1_18/FC8_TXD_SCL_MISO/SCT0_OUT5/CAN1_RD/EMC_BLSN(1), label: Fuel Gauge int pin, identifier: FG_INT}
- {pin_num: H14, pin_signal: PIO2_27/LCD_VD(9)/FC9_SCK/FC3_SSEL2, label: Touchpanel reset pin, identifier: TP_RST}
- {pin_num: L2, pin_signal: PIO3_12/SCT0_OUT8/CTIMER3_CAP0/CLKOUT/EMC_CLK(1)/TRACECLK, label: WiFi wake up pin, identifier: WIFI_WAKEUP}
- {pin_num: M6, pin_signal: PIO3_18/FC8_CTS_SDA_SSEL0/SD_D(6)/CTIMER4_MAT0/CAN0_TD/SCT0_OUT5, label: BLE reserved, identifier: BT_REV1}
- {pin_num: J3, pin_signal: PIO3_19/FC8_RTS_SCL_SSEL1/SD_D(7)/CTIMER4_MAT1/CAN0_RD/SCT0_OUT6, label: BLE STA pin, identifier: BT_STA}
- {pin_num: N2, pin_signal: PIO3_20/FC9_SCK/SD_CARD_INT_N/CLKOUT/SCT0_OUT7, label: LCD SPI clock pin, identifier: LCD_SPI_CLK}
- {pin_num: P5, pin_signal: PIO3_21/FC9_RXD_SDA_MOSI/SD_BACKEND_PWR/CTIMER4_MAT3/UTICK_CAP2/ADC0_9, label: LCD SPI MOSI pin, identifier: LCD_SPI_MOSI}
- {pin_num: N5, pin_signal: PIO3_22/FC9_TXD_SCL_MISO/ADC0_10, label: LCD SPI MISO pin, identifier: LCD_SPI_MISO}
- {pin_num: K5, pin_signal: PIO3_26/SCT0_OUT0/FC4_RXD_SDA_MOSI/EMC_A(15), label: BLE STA1 pin, identifier: BT_STA1}
- {pin_num: P14, pin_signal: PIO3_27/SCT0_OUT1/FC4_TXD_SCL_MISO/EMC_A(16), label: BLE reset pin, identifier: BT_RST}
- {pin_num: L13, pin_signal: PIO3_29/SCT0_OUT3/FC4_RTS_SCL_SSEL1/EMC_A(18), label: BLE reset1 pin, identifier: BT_RST1}
- {pin_num: K13, pin_signal: PIO3_30/FC9_CTS_SDA_SSEL0/SCT0_OUT4/FC4_SSEL2/EMC_A(19), label: LCD SPI CS pin, identifier: LCD_SPI_CS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "pin_mux.h"

/*FUNCTION**********************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 *END**************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitSDRAMPins();
    BOARD_InitSPIFIPins();
    BOARD_InitUSBPins();
    BOARD_InitSWDPins();
    BOARD_InitLCDPins();
    BOARD_InitAudioPins();
    BOARD_InitIrDAPins();
    BOARD_InitKeyboardPins();
    BOARD_InitChargePins();
    BOARD_InitWiFiPins();
    BOARD_InitBlePins();
    BOARD_InitTouchpanelPins();
    BOARD_InitZigbeePins();
}

#define PIO023_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO024_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO025_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO026_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO027_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO027_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO028_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO028_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */

