sunklCoin/MCU/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIFIPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: M13, peripheral: SPIFI0, signal: SPIFI_SCK, pin_signal: PIO0_26/FC2_RXD_SDA_MOSI/CLKOUT/CTIMER3_CAP2/SCT0_OUT5/PDM0_CLK/SPIFI_CLK/USB0_IDVALUE}
  - {pin_num: M7, peripheral: SPIFI0, signal: SPIFI_IO0/SPIFI_MOSI, pin_signal: PIO0_24/FC0_RXD_SDA_MOSI/SD_D(0)/CTIMER2_CAP0/SCT0_GPI0/SPIFI_IO(0)}
  - {pin_num: K8, peripheral: SPIFI0, signal: SPIFI_IO1/SPIFI_MISO, pin_signal: PIO0_25/FC0_TXD_SCL_MISO/SD_D(1)/CTIMER2_CAP1/SCT0_GPI1/SPIFI_IO(1)}
  - {pin_num: L9, peripheral: SPIFI0, signal: 'SPIFI_IO, 3', pin_signal: PIO0_27/FC2_TXD_SCL_MISO/CTIMER3_MAT2/SCT0_OUT6/PDM0_DATA/SPIFI_IO(3)}
  - {pin_num: M9, peripheral: SPIFI0, signal: 'SPIFI_IO, 2', pin_signal: PIO0_28/FC0_SCK/CTIMER2_CAP3/SCT0_OUT7/TRACEDATA(3)/SPIFI_IO(2)/USB0_OVERCURRENTN}
  - {pin_num: N7, peripheral: SPIFI0, signal: SPIFI_CSN, pin_signal: PIO0_23/MCLK/CTIMER1_MAT2/CTIMER3_MAT3/SCT0_OUT4/SPIFI_CSN/ADC0_11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitSPIFIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitSPIFIPins(void) { /* Function assigned for the Core #0 (ARM Cortex-M4) */
  CLOCK_EnableClock(kCLOCK_Iocon);                           /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */

  IOCON->PIO[0][23] = ((IOCON->PIO[0][23] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO023_FUNC_ALT6)                     /* Selects pin function.: PORT023 (pin N7) is configured as SPIFI_CSN */
      | IOCON_PIO_DIGIMODE(PIO023_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][24] = ((IOCON->PIO[0][24] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO024_FUNC_ALT6)                     /* Selects pin function.: PORT024 (pin M7) is configured as SPIFI_IO(0) */
      | IOCON_PIO_DIGIMODE(PIO024_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][25] = ((IOCON->PIO[0][25] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO025_FUNC_ALT6)                     /* Selects pin function.: PORT025 (pin K8) is configured as SPIFI_IO(1) */
      | IOCON_PIO_DIGIMODE(PIO025_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][26] = ((IOCON->PIO[0][26] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO026_FUNC_ALT6)                     /* Selects pin function.: PORT026 (pin M13) is configured as SPIFI_CLK */
      | IOCON_PIO_DIGIMODE(PIO026_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][27] = ((IOCON->PIO[0][27] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO027_FUNC_ALT6)                     /* Selects pin function.: PORT027 (pin L9) is configured as SPIFI_IO(3) */
      | IOCON_PIO_DIGIMODE(PIO027_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][28] = ((IOCON->PIO[0][28] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO028_FUNC_ALT6)                     /* Selects pin function.: PORT028 (pin M9) is configured as SPIFI_IO(2) */
      | IOCON_PIO_DIGIMODE(PIO028_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
}


#define PIO015_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO015_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO018_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO018_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO019_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO019_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO020_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO020_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO021_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO021_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO02_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO02_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO03_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO03_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO04_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO05_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO05_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO06_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO06_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO07_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO07_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO08_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO08_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO09_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO09_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO110_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO110_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO111_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO111_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO112_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO112_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO113_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO113_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO114_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO114_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO115_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO115_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO116_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO116_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO119_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO119_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO120_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO120_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO121_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO121_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO122_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO122_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO123_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO123_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO125_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO125_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO126_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO126_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO127_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO127_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO128_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO128_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO129_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO129_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO130_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO130_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO131_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO131_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO14_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO14_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO15_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO15_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO16_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO16_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO17_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO17_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO18_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO18_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO19_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO19_FUNC_ALT6               0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO325_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO325_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */

