sunklCoin/MCU/board/pin_mux.c
  IOCON->PIO[0][15] = ((IOCON->PIO[0][15] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO015_FUNC_ALT6)                     /* Selects pin function.: PORT015 (pin L4) is configured as EMC_WEN */
      | IOCON_PIO_DIGIMODE(PIO015_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][18] = ((IOCON->PIO[0][18] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO018_FUNC_ALT6)                     /* Selects pin function.: PORT018 (pin C14) is configured as EMC_A(0) */
      | IOCON_PIO_DIGIMODE(PIO018_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][19] = ((IOCON->PIO[0][19] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO019_FUNC_ALT6)                     /* Selects pin function.: PORT019 (pin C6) is configured as EMC_A(1) */
      | IOCON_PIO_DIGIMODE(PIO019_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][2] = ((IOCON->PIO[0][2] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO02_FUNC_ALT6)                      /* Selects pin function.: PORT02 (pin E9) is configured as EMC_D(0) */
      | IOCON_PIO_DIGIMODE(PIO02_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][20] = ((IOCON->PIO[0][20] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO020_FUNC_ALT6)                     /* Selects pin function.: PORT020 (pin D13) is configured as EMC_A(2) */
      | IOCON_PIO_DIGIMODE(PIO020_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][21] = ((IOCON->PIO[0][21] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO021_FUNC_ALT6)                     /* Selects pin function.: PORT021 (pin C13) is configured as EMC_A(3) */
      | IOCON_PIO_DIGIMODE(PIO021_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][3] = ((IOCON->PIO[0][3] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO03_FUNC_ALT6)                      /* Selects pin function.: PORT03 (pin A10) is configured as EMC_D(1) */
      | IOCON_PIO_DIGIMODE(PIO03_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][4] = ((IOCON->PIO[0][4] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO04_FUNC_ALT6)                      /* Selects pin function.: PORT04 (pin C8) is configured as EMC_D(2) */
      | IOCON_PIO_DIGIMODE(PIO04_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][5] = ((IOCON->PIO[0][5] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO05_FUNC_ALT6)                      /* Selects pin function.: PORT05 (pin E7) is configured as EMC_D(3) */
      | IOCON_PIO_DIGIMODE(PIO05_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][6] = ((IOCON->PIO[0][6] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO06_FUNC_ALT6)                      /* Selects pin function.: PORT06 (pin A5) is configured as EMC_D(4) */
      | IOCON_PIO_DIGIMODE(PIO06_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][7] = ((IOCON->PIO[0][7] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO07_FUNC_ALT6)                      /* Selects pin function.: PORT07 (pin H12) is configured as EMC_D(5) */
      | IOCON_PIO_DIGIMODE(PIO07_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][8] = ((IOCON->PIO[0][8] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO08_FUNC_ALT6)                      /* Selects pin function.: PORT08 (pin H10) is configured as EMC_D(6) */
      | IOCON_PIO_DIGIMODE(PIO08_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][9] = ((IOCON->PIO[0][9] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO09_FUNC_ALT6)                      /* Selects pin function.: PORT09 (pin G12) is configured as EMC_D(7) */
      | IOCON_PIO_DIGIMODE(PIO09_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][10] = ((IOCON->PIO[1][10] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO110_FUNC_ALT6)                     /* Selects pin function.: PORT110 (pin N9) is configured as EMC_RASN */
      | IOCON_PIO_DIGIMODE(PIO110_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][11] = ((IOCON->PIO[1][11] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO111_FUNC_ALT6)                     /* Selects pin function.: PORT111 (pin B4) is configured as EMC_CLK(0) */
      | IOCON_PIO_DIGIMODE(PIO111_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][12] = ((IOCON->PIO[1][12] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO112_FUNC_ALT6)                     /* Selects pin function.: PORT112 (pin K9) is configured as EMC_DYCSN(0) */
      | IOCON_PIO_DIGIMODE(PIO112_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][13] = ((IOCON->PIO[1][13] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO113_FUNC_ALT6)                     /* Selects pin function.: PORT113 (pin G10) is configured as EMC_DQM(0) */
      | IOCON_PIO_DIGIMODE(PIO113_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][14] = ((IOCON->PIO[1][14] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO114_FUNC_ALT6)                     /* Selects pin function.: PORT114 (pin C12) is configured as EMC_DQM(1) */
      | IOCON_PIO_DIGIMODE(PIO114_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][15] = ((IOCON->PIO[1][15] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO115_FUNC_ALT6)                     /* Selects pin function.: PORT115 (pin A11) is configured as EMC_CKE(0) */
      | IOCON_PIO_DIGIMODE(PIO115_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][16] = ((IOCON->PIO[1][16] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO116_FUNC_ALT6)                     /* Selects pin function.: PORT116 (pin B7) is configured as EMC_A(10) */
      | IOCON_PIO_DIGIMODE(PIO116_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][19] = ((IOCON->PIO[1][19] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO119_FUNC_ALT6)                     /* Selects pin function.: PORT119 (pin L1) is configured as EMC_D(8) */
      | IOCON_PIO_DIGIMODE(PIO119_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][20] = ((IOCON->PIO[1][20] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO120_FUNC_ALT6)                     /* Selects pin function.: PORT120 (pin M1) is configured as EMC_D(9) */
      | IOCON_PIO_DIGIMODE(PIO120_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][21] = ((IOCON->PIO[1][21] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO121_FUNC_ALT6)                     /* Selects pin function.: PORT121 (pin N8) is configured as EMC_D(10) */
      | IOCON_PIO_DIGIMODE(PIO121_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][22] = ((IOCON->PIO[1][22] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO122_FUNC_ALT6)                     /* Selects pin function.: PORT122 (pin P11) is configured as EMC_CKE(1) */
      | IOCON_PIO_DIGIMODE(PIO122_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][23] = ((IOCON->PIO[1][23] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO123_FUNC_ALT6)                     /* Selects pin function.: PORT123 (pin M10) is configured as EMC_A(11) */
      | IOCON_PIO_DIGIMODE(PIO123_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][25] = ((IOCON->PIO[1][25] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO125_FUNC_ALT6)                     /* Selects pin function.: PORT125 (pin M12) is configured as EMC_A(13) */
      | IOCON_PIO_DIGIMODE(PIO125_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][26] = ((IOCON->PIO[1][26] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO126_FUNC_ALT6)                     /* Selects pin function.: PORT126 (pin J10) is configured as EMC_A(8) */
      | IOCON_PIO_DIGIMODE(PIO126_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][27] = ((IOCON->PIO[1][27] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO127_FUNC_ALT6)                     /* Selects pin function.: PORT127 (pin F10) is configured as EMC_A(9) */
      | IOCON_PIO_DIGIMODE(PIO127_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][28] = ((IOCON->PIO[1][28] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO128_FUNC_ALT6)                     /* Selects pin function.: PORT128 (pin E12) is configured as EMC_D(12) */
      | IOCON_PIO_DIGIMODE(PIO128_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][29] = ((IOCON->PIO[1][29] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO129_FUNC_ALT6)                     /* Selects pin function.: PORT129 (pin C11) is configured as EMC_D(13) */
      | IOCON_PIO_DIGIMODE(PIO129_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][30] = ((IOCON->PIO[1][30] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO130_FUNC_ALT6)                     /* Selects pin function.: PORT130 (pin A8) is configured as EMC_D(14) */
      | IOCON_PIO_DIGIMODE(PIO130_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][31] = ((IOCON->PIO[1][31] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO131_FUNC_ALT6)                     /* Selects pin function.: PORT131 (pin C5) is configured as EMC_D(15) */
      | IOCON_PIO_DIGIMODE(PIO131_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][4] = ((IOCON->PIO[1][4] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO14_FUNC_ALT6)                      /* Selects pin function.: PORT14 (pin D4) is configured as EMC_D(11) */
      | IOCON_PIO_DIGIMODE(PIO14_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][5] = ((IOCON->PIO[1][5] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO15_FUNC_ALT6)                      /* Selects pin function.: PORT15 (pin E4) is configured as EMC_A(4) */
      | IOCON_PIO_DIGIMODE(PIO15_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][6] = ((IOCON->PIO[1][6] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO16_FUNC_ALT6)                      /* Selects pin function.: PORT16 (pin G4) is configured as EMC_A(5) */
      | IOCON_PIO_DIGIMODE(PIO16_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][7] = ((IOCON->PIO[1][7] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO17_FUNC_ALT6)                      /* Selects pin function.: PORT17 (pin N1) is configured as EMC_A(6) */
      | IOCON_PIO_DIGIMODE(PIO17_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][8] = ((IOCON->PIO[1][8] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO18_FUNC_ALT6)                      /* Selects pin function.: PORT18 (pin P8) is configured as EMC_A(7) */
      | IOCON_PIO_DIGIMODE(PIO18_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[1][9] = ((IOCON->PIO[1][9] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO19_FUNC_ALT6)                      /* Selects pin function.: PORT19 (pin K6) is configured as EMC_CASN */
      | IOCON_PIO_DIGIMODE(PIO19_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][25] = ((IOCON->PIO[3][25] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO325_FUNC_ALT6)                     /* Selects pin function.: PORT325 (pin P9) is configured as EMC_A(14) */
      | IOCON_PIO_DIGIMODE(PIO325_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
}


