sunklCoin/MCU/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSBPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: H3, peripheral: USBHSH, signal: USB_DP, pin_signal: USB1_DP}
  - {pin_num: H2, peripheral: USBHSH, signal: USB_DM, pin_signal: USB1_DM}
  - {pin_num: G2, peripheral: USBHSH, signal: USB_VBUS, pin_signal: USB1_VBUS}
  - {pin_num: G1, peripheral: USBHSH, signal: USB_IDVALUE, pin_signal: USB1_ID}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitUSBPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitUSBPins(void) { /* Function assigned for the Core #0 (ARM Cortex-M4) */
}


#define PIO010_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO010_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO011_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */
#define PIO012_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT6              0x06u   /*!< Selects pin function.: Alternative connection 6. */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWDPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: M3, peripheral: SWD, signal: SWDIO, pin_signal: PIO0_12/FC3_TXD_SCL_MISO/FREQME_GPIO_CLK_B/SCT0_GPI7/SWDIO/ADC0_2}
  - {pin_num: L3, peripheral: SWD, signal: SWCLK, pin_signal: PIO0_11/FC6_RXD_SDA_MOSI_DATA/CTIMER2_MAT2/FREQME_GPIO_CLK_A/SWCLK/ADC0_1}
  - {pin_num: P2, peripheral: SWD, signal: SWO, pin_signal: PIO0_10/FC6_SCK/CTIMER2_CAP2/CTIMER2_MAT0/FC1_TXD_SCL_MISO/SWO/ADC0_0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitSWDPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitSWDPins(void) { /* Function assigned for the Core #0 (ARM Cortex-M4) */
  CLOCK_EnableClock(kCLOCK_Iocon);                           /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */

  IOCON->PIO[0][10] = ((IOCON->PIO[0][10] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO010_FUNC_ALT6)                     /* Selects pin function.: PORT010 (pin P2) is configured as SWO */
      | IOCON_PIO_DIGIMODE(PIO010_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][11] = ((IOCON->PIO[0][11] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO011_FUNC_ALT6)                     /* Selects pin function.: PORT011 (pin L3) is configured as SWCLK */
      | IOCON_PIO_DIGIMODE(PIO011_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[0][12] = ((IOCON->PIO[0][12] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO012_FUNC_ALT6)                     /* Selects pin function.: PORT012 (pin M3) is configured as SWDIO */
      | IOCON_PIO_DIGIMODE(PIO012_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
}


#define PIO211_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO211_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO213_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO213_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO214_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO214_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO215_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO215_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO216_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO216_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO221_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO221_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO222_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO222_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO223_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO223_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO224_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO224_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO225_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO225_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO228_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO228_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO229_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO229_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO230_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO230_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO231_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO231_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO30_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO30_FUNC_ALT1               0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO31_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO31_FUNC_ALT1               0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO320_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO320_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO321_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO321_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO322_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO322_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO330_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO330_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO33_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO33_FUNC_ALT0               0x00u   /*!< Selects pin function.: Alternative connection 0. */
#define PIO35_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO35_FUNC_ALT1               0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO36_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO36_FUNC_ALT1               0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO37_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO37_FUNC_ALT1               0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO38_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO38_FUNC_ALT1               0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO39_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO39_FUNC_ALT1               0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO416_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO416_FUNC_ALT0              0x00u   /*!< Selects pin function.: Alternative connection 0. */

