sunklCoin/MCU/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBlePins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: M5, peripheral: GPIO, signal: 'PIO0, 31', pin_signal: PIO0_31/FC0_CTS_SDA_SSEL0/SD_D(2)/CTIMER0_MAT1/SCT0_OUT3/TRACEDATA(0)/ADC0_5}
  - {pin_num: E3, peripheral: GPIO, signal: 'PIO3, 14', pin_signal: PIO3_14/SCT0_OUT4/FC9_RTS_SCL_SSEL1/CTIMER3_MAT1/TRACEDATA(2)}
  - {pin_num: E1, peripheral: FLEXCOMM8, signal: RXD_SDA_MOSI, pin_signal: PIO3_16/FC8_RXD_SDA_MOSI/SD_D(4)}
  - {pin_num: K1, peripheral: FLEXCOMM8, signal: TXD_SCL_MISO, pin_signal: PIO3_17/FC8_TXD_SCL_MISO/SD_D(5)}
  - {pin_num: J3, peripheral: GPIO, signal: 'PIO3, 19', pin_signal: PIO3_19/FC8_RTS_SCL_SSEL1/SD_D(7)/CTIMER4_MAT1/CAN0_RD/SCT0_OUT6}
  - {pin_num: K5, peripheral: GPIO, signal: 'PIO3, 26', pin_signal: PIO3_26/SCT0_OUT0/FC4_RXD_SDA_MOSI/EMC_A(15)}
  - {pin_num: P14, peripheral: GPIO, signal: 'PIO3, 27', pin_signal: PIO3_27/SCT0_OUT1/FC4_TXD_SCL_MISO/EMC_A(16)}
  - {pin_num: L13, peripheral: GPIO, signal: 'PIO3, 29', pin_signal: PIO3_29/SCT0_OUT3/FC4_RTS_SCL_SSEL1/EMC_A(18)}
  - {pin_num: D2, peripheral: GPIO, signal: 'PIO3, 15', pin_signal: PIO3_15/FC8_SCK/SD_WR_PRT}
  - {pin_num: M6, peripheral: GPIO, signal: 'PIO3, 18', pin_signal: PIO3_18/FC8_CTS_SDA_SSEL0/SD_D(6)/CTIMER4_MAT0/CAN0_TD/SCT0_OUT5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitBlePins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitBlePins(void) { /* Function assigned for the Core #0 (ARM Cortex-M4) */
  CLOCK_EnableClock(kCLOCK_Iocon);                           /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */

  IOCON->PIO[0][31] = ((IOCON->PIO[0][31] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO031_FUNC_ALT0)                     /* Selects pin function.: PORT031 (pin M5) is configured as PIO0_31 */
      | IOCON_PIO_DIGIMODE(PIO031_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][14] = ((IOCON->PIO[3][14] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO314_FUNC_ALT0)                     /* Selects pin function.: PORT314 (pin E3) is configured as PIO3_14 */
      | IOCON_PIO_DIGIMODE(PIO314_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][15] = ((IOCON->PIO[3][15] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO315_FUNC_ALT0)                     /* Selects pin function.: PORT315 (pin D2) is configured as PIO3_15 */
      | IOCON_PIO_DIGIMODE(PIO315_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][16] = ((IOCON->PIO[3][16] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO316_FUNC_ALT1)                     /* Selects pin function.: PORT316 (pin E1) is configured as FC8_RXD_SDA_MOSI */
      | IOCON_PIO_DIGIMODE(PIO316_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][17] = ((IOCON->PIO[3][17] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO317_FUNC_ALT1)                     /* Selects pin function.: PORT317 (pin K1) is configured as FC8_TXD_SCL_MISO */
      | IOCON_PIO_DIGIMODE(PIO317_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][18] = ((IOCON->PIO[3][18] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO318_FUNC_ALT0)                     /* Selects pin function.: PORT318 (pin M6) is configured as PIO3_18 */
      | IOCON_PIO_DIGIMODE(PIO318_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][19] = ((IOCON->PIO[3][19] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO319_FUNC_ALT0)                     /* Selects pin function.: PORT319 (pin J3) is configured as PIO3_19 */
      | IOCON_PIO_DIGIMODE(PIO319_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][26] = ((IOCON->PIO[3][26] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO326_FUNC_ALT0)                     /* Selects pin function.: PORT326 (pin K5) is configured as PIO3_26 */
      | IOCON_PIO_DIGIMODE(PIO326_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][27] = ((IOCON->PIO[3][27] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO327_FUNC_ALT0)                     /* Selects pin function.: PORT327 (pin P14) is configured as PIO3_27 */
      | IOCON_PIO_DIGIMODE(PIO327_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][29] = ((IOCON->PIO[3][29] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO329_FUNC_ALT0)                     /* Selects pin function.: PORT329 (pin L13) is configured as PIO3_29 */
      | IOCON_PIO_DIGIMODE(PIO329_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
}


#define PIO117_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO117_FUNC_ALT0              0x00u   /*!< Selects pin function.: Alternative connection 0. */
#define PIO227_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO227_FUNC_ALT0              0x00u   /*!< Selects pin function.: Alternative connection 0. */
#define PIO323_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1              0x01u   /*!< Selects pin function.: Alternative connection 1. */

