sunklCoin/MCU/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTouchpanelPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N12, peripheral: GPIO, signal: 'PIO1, 17', pin_signal: PIO1_17/ENET_MDIO/FC8_RXD_SDA_MOSI/SCT0_OUT4/CAN1_TD/EMC_BLSN(0)}
  - {pin_num: H14, peripheral: GPIO, signal: 'PIO2, 27', pin_signal: PIO2_27/LCD_VD(9)/FC9_SCK/FC3_SSEL2}
  - {pin_num: C2, peripheral: FLEXCOMM2, signal: CTS_SDA_SSEL0, pin_signal: PIO3_23/FC2_CTS_SDA_SSEL0/UTICK_CAP3}
  - {pin_num: E2, peripheral: FLEXCOMM2, signal: RTS_SCL_SSEL1, pin_signal: PIO3_24/FC2_RTS_SCL_SSEL1/CTIMER4_CAP0/USB0_VBUS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitTouchpanelPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitTouchpanelPins(void) { /* Function assigned for the Core #0 (ARM Cortex-M4) */
  CLOCK_EnableClock(kCLOCK_Iocon);                           /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */

  IOCON->PIO[1][17] = ((IOCON->PIO[1][17] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO117_FUNC_ALT0)                     /* Selects pin function.: PORT117 (pin N12) is configured as PIO1_17 */
      | IOCON_PIO_DIGIMODE(PIO117_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[2][27] = ((IOCON->PIO[2][27] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO227_FUNC_ALT0)                     /* Selects pin function.: PORT227 (pin H14) is configured as PIO2_27 */
      | IOCON_PIO_DIGIMODE(PIO227_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][23] = ((IOCON->PIO[3][23] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO323_FUNC_ALT1)                     /* Selects pin function.: PORT323 (pin C2) is configured as FC2_CTS_SDA_SSEL0 */
      | IOCON_PIO_DIGIMODE(PIO323_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][24] = ((IOCON->PIO[3][24] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO324_FUNC_ALT1)                     /* Selects pin function.: PORT324 (pin E2) is configured as FC2_RTS_SCL_SSEL1 */
      | IOCON_PIO_DIGIMODE(PIO324_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
}


#define PIO210_DIGIMODE_DIGITAL       0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO210_FUNC_ALT0              0x00u   /*!< Selects pin function.: Alternative connection 0. */
#define PIO22_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO22_FUNC_ALT0               0x00u   /*!< Selects pin function.: Alternative connection 0. */
#define PIO23_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO23_FUNC_ALT3               0x03u   /*!< Selects pin function.: Alternative connection 3. */
#define PIO24_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO24_FUNC_ALT3               0x03u   /*!< Selects pin function.: Alternative connection 3. */
#define PIO25_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO25_FUNC_ALT3               0x03u   /*!< Selects pin function.: Alternative connection 3. */
#define PIO26_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO26_FUNC_ALT3               0x03u   /*!< Selects pin function.: Alternative connection 3. */
#define PIO32_DIGIMODE_DIGITAL        0x01u   /*!< Select Analog/Digital mode.: Digital mode. */
#define PIO32_FUNC_ALT0               0x00u   /*!< Selects pin function.: Alternative connection 0. */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitZigbeePins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: C3, peripheral: GPIO, signal: 'PIO2, 2', pin_signal: PIO2_2/ENET_CRS/FC3_SSEL3/SCT0_OUT6/CTIMER1_MAT1}
  - {pin_num: B1, peripheral: FLEXCOMM1, signal: RXD_SDA_MOSI, pin_signal: PIO2_3/ENET_TXD2/SD_CLK/FC1_RXD_SDA_MOSI/CTIMER2_MAT0}
  - {pin_num: D3, peripheral: FLEXCOMM1, signal: TXD_SCL_MISO, pin_signal: PIO2_4/ENET_TXD3/SD_CMD/FC1_TXD_SCL_MISO/CTIMER2_MAT1}
  - {pin_num: C1, peripheral: FLEXCOMM1, signal: CTS_SDA_SSEL0, pin_signal: PIO2_5/ENET_TX_ER/SD_POW_EN/FC1_CTS_SDA_SSEL0/CTIMER1_MAT2}
  - {pin_num: F3, peripheral: FLEXCOMM1, signal: RTS_SCL_SSEL1, pin_signal: PIO2_6/ENET_TX_CLK/SD_D(0)/FC1_RTS_SCL_SSEL1/CTIMER0_CAP0}
  - {pin_num: P1, peripheral: GPIO, signal: 'PIO2, 10', pin_signal: PIO2_10/ENET_RX_ER/SD_CARD_DET_N}
  - {pin_num: C10, peripheral: GPIO, signal: 'PIO3, 2', pin_signal: PIO3_2/LCD_VD(16)/FC9_RXD_SDA_MOSI/CTIMER1_MAT2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitZigbeePins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitZigbeePins(void) { /* Function assigned for the Core #0 (ARM Cortex-M4) */
  CLOCK_EnableClock(kCLOCK_Iocon);                           /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */

  IOCON->PIO[2][10] = ((IOCON->PIO[2][10] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO210_FUNC_ALT0)                     /* Selects pin function.: PORT210 (pin P1) is configured as PIO2_10 */
      | IOCON_PIO_DIGIMODE(PIO210_DIGIMODE_DIGITAL)          /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[2][2] = ((IOCON->PIO[2][2] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO22_FUNC_ALT0)                      /* Selects pin function.: PORT22 (pin C3) is configured as PIO2_2 */
      | IOCON_PIO_DIGIMODE(PIO22_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[2][3] = ((IOCON->PIO[2][3] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO23_FUNC_ALT3)                      /* Selects pin function.: PORT23 (pin B1) is configured as FC1_RXD_SDA_MOSI */
      | IOCON_PIO_DIGIMODE(PIO23_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[2][4] = ((IOCON->PIO[2][4] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO24_FUNC_ALT3)                      /* Selects pin function.: PORT24 (pin D3) is configured as FC1_TXD_SCL_MISO */
      | IOCON_PIO_DIGIMODE(PIO24_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[2][5] = ((IOCON->PIO[2][5] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO25_FUNC_ALT3)                      /* Selects pin function.: PORT25 (pin C1) is configured as FC1_CTS_SDA_SSEL0 */
      | IOCON_PIO_DIGIMODE(PIO25_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[2][6] = ((IOCON->PIO[2][6] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO26_FUNC_ALT3)                      /* Selects pin function.: PORT26 (pin F3) is configured as FC1_RTS_SCL_SSEL1 */
      | IOCON_PIO_DIGIMODE(PIO26_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
  IOCON->PIO[3][2] = ((IOCON->PIO[3][2] &
    (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))      /* Mask bits to zero which are setting */
      | IOCON_PIO_FUNC(PIO32_FUNC_ALT0)                      /* Selects pin function.: PORT32 (pin C10) is configured as PIO3_2 */
      | IOCON_PIO_DIGIMODE(PIO32_DIGIMODE_DIGITAL)           /* Select Analog/Digital mode.: Digital mode. */
    );
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
